## 计网上机实验报告

### 1. 拓扑图

![1559803107203](/home/lfm/.config/Typora/typora-user-images/1559803107203.png)



### 2. 实验步骤

#### 2.1 VLAN配置

将 SW1 和 SW2 之间的链路设置为 Trunk 链路

```
sw1(config)#interface G1/0/3
sw1(config-if)#switchport mode trunk

sw2(config)#interface G1/0/1
sw2(config-if)#switchport mode trunk
```

划分两个 Vlan， Vlan 10 和 Vlan 20

```
sw1(config)#vlan 10
sw2(config)#vlan 20
```

分别将 SW1 和 SW2 的 `G1/0/1` 口划分入 `Vlan 10`， `G1/0/2` 口划分入 `Vlan 20`。

```
sw1(config)#interface G1/0/1
sw1(config-if)#switchport mode access
sw1(config-if)#swichport access vlan 10
sw1(config-if)#exit
sw1(config)#interface G1/0/2
sw1(config-if)#switchport mode access
sw1(config-if)#switchport access vlan 20
```

sw2同理 

```
sw2(config)#interface G1/0/2
sw2(config-if)#switchport mode access
sw2(config-if)#swichport access vlan 10
sw2(config-if)#exit
sw2(config)#interface G1/0/3
sw2(config-if)#switchport mode access
sw2(config-if)#switchport access vlan 20
```

将 sw1 的 `G1/0/5` 设置 trunk , 与路由器互联

```
sw1(config)#interface G1/0/5
sw1(config-if)#switchport mode trunk
```

Router 的 `G1/0/0` 口需要划分两个子接口，分别对应 Vlan10 和 Vlan20，作为它们的
网关。

```
Router(config)#interface G1/0/0
Router(config-if)#no ip address
Router(config-if)#no shutdown
Router(config)#int G1/0/0.10
Router(config-if)#encapsulation dot1q 10
Router(config-if)#ip address 192.168.10.1 255.255.255.0
Router(config)#int G1/0/0.20
Router(config-if)#encapsulation dot1q 20
Router(config-if)#ip address 192.168.20.1 255.255.255.0
```

接下来配置四台PC 的主机IP

| 主机 | IP           |
| ---- | ------------ |
| 1    | 192.168.10.2 |
| 2    | 192.168.20.2 |
| 3    | 192.168.10.3 |
| 4    | 192.168.20.3 |

让 PC1 来 ping PC2 , 

`ping from 192.168.10.2 to 192.168.20.2`

```
sw1 # ping 192.168.20.2
```

#### 2.2 NAT 配置

配置IP





### 2.3 LAC

